export const KHMER_WEEKDAYS = [
  'ថ្ងៃអាទិត្យ',
  'ថ្ងៃចន្ទ',
  'ថ្ងៃអង្គារ',
  'ថ្ងៃពុធ',
  'ថ្ងៃព្រហស្បតិ៍',
  'ថ្ងៃសុក្រ',
  'ថ្ងៃសៅរ៍',
] as const;

export const KHMER_LUNAR_MONTHS = [
  'ខែចេត្រ',
  'ខែពិសាខ',
  'ខែជេស្ឋ',
  'ខែអាសាឍ',
  'ខែស្រាពណ៍',
  'ខែភទ្របទ',
  'ខែអស្សុជ',
  'ខែកត្តិក',
  'ខែមិគសិរ',
  'ខែបុស្ស',
  'ខែមាឃ',
  'ខែផល្គុន',
] as const;

export const KHMER_ZODIAC = [
  'ឆ្នាំជូត',
  'ឆ្នាំឆ្លូវ',
  'ឆ្នាំខាល',
  'ឆ្នាំថោះ',
  'ឆ្នាំរោង',
  'ឆ្នាំម្សាញ់',
  'ឆ្នាំមមី',
  'ឆ្នាំមមែ',
  'ឆ្នាំវក',
  'ឆ្នាំរកា',
  'ឆ្នាំច',
  'ឆ្នាំកុរ',
] as const;

export const KHMER_SAK = [
  'ច',
  'ឆ',
  'ដ',
  'ត',
  'ថ',
  'ទ',
  'ធ',
  'ន',
  'ប',
  'ម',
] as const;

export const KHMER_LUNAR_PHASES = {
  WAXING: 'កើត',
  WANING: 'រោច',
} as const;

export const KHMER_DIGITS = [
  '០',
  '១',
  '២',
  '៣',
  '៤',
  '៥',
  '៦',
  '៧',
  '៨',
  '៩',
] as const;